{
    "userid": {
        "__PAD__": 0,
        "874257": 1,
        "227368": 2,
        "911194": 3,
        "514836": 4,
        "693616": 5,
        "479339": 6,
        "549940": 7,
        "608569": 8,
        "832981": 9,
        "992364": 10,
        "664542": 11,
        "616268": 12,
        "871665": 13,
        "754948": 14,
        "524548": 15,
        "268502": 16,
        "55033": 17,
        "370363": 18,
        "477708": 19,
        "353405": 20,
        "626053": 21,
        "391781": 22,
        "1115242": 23,
        "949173": 24,
        "__OOV__": 25
    },
    "adgroup_id": {
        "__PAD__": 0,
        "170301": 1,
        "756739": 2,
        "573514": 3,
        "680144": 4,
        "172298": 5,
        "513129": 6,
        "54756": 7,
        "431258": 8,
        "605570": 9,
        "722867": 10,
        "674268": 11,
        "158525": 12,
        "633154": 13,
        "659142": 14,
        "467092": 15,
        "570475": 16,
        "702219": 17,
        "383937": 18,
        "627549": 19,
        "553889": 20,
        "148505": 21,
        "572396": 22,
        "636019": 23,
        "194654": 24,
        "27032": 25,
        "576624": 26,
        "662621": 27,
        "225892": 28,
        "679190": 29,
        "519384": 30,
        "362454": 31,
        "117738": 32,
        "588074": 33,
        "690119": 34,
        "164095": 35,
        "703594": 36,
        "454239": 37,
        "169140": 38,
        "789390": 39,
        "395732": 40,
        "654663": 41,
        "323703": 42,
        "263526": 43,
        "696459": 44,
        "118678": 45,
        "223448": 46,
        "698324": 47,
        "758902": 48,
        "595104": 49,
        "646876": 50,
        "571696": 51,
        "537137": 52,
        "726574": 53,
        "320222": 54,
        "681978": 55,
        "596489": 56,
        "713414": 57,
        "472153": 58,
        "339931": 59,
        "561543": 60,
        "192645": 61,
        "512277": 62,
        "452391": 63,
        "601638": 64,
        "415119": 65,
        "366559": 66,
        "41803": 67,
        "261620": 68,
        "168937": 69,
        "318447": 70,
        "506323": 71,
        "677904": 72,
        "620312": 73,
        "687140": 74,
        "541502": 75,
        "361919": 76,
        "734869": 77,
        "570906": 78,
        "530249": 79,
        "675017": 80,
        "545057": 81,
        "214782": 82,
        "594936": 83,
        "651184": 84,
        "540137": 85,
        "473741": 86,
        "663034": 87,
        "636508": 88,
        "530563": 89,
        "87979": 90,
        "477950": 91,
        "604453": 92,
        "444691": 93,
        "742211": 94,
        "__OOV__": 95
    },
    "pid": {
        "__PAD__": 0,
        "430548_1007": 1,
        "430539_1007": 2,
        "__OOV__": 3
    },
    "cate_id": {
        "__PAD__": 0,
        "6261": 1,
        "4505": 2,
        "4281": 3,
        "4385": 4,
        "1665": 5,
        "4292": 6,
        "4520": 7,
        "6407": 8,
        "824": 9,
        "5443": 10,
        "5851": 11,
        "7212": 12,
        "4283": 13,
        "4609": 14,
        "4267": 15,
        "6286": 16,
        "6255": 17,
        "1535": 18,
        "8112": 19,
        "6251": 20,
        "5487": 21,
        "6426": 22,
        "2201": 23,
        "9784": 24,
        "4278": 25,
        "4532": 26,
        "6433": 27,
        "4282": 28,
        "6183": 29,
        "333": 30,
        "5316": 31,
        "10876": 32,
        "4288": 33,
        "6158": 34,
        "9460": 35,
        "4280": 36,
        "1226": 37,
        "6760": 38,
        "6140": 39,
        "8202": 40,
        "6733": 41,
        "7339": 42,
        "6432": 43,
        "5263": 44,
        "7184": 45,
        "6416": 46,
        "4284": 47,
        "__OOV__": 48
    },
    "campaign_id": {
        "__PAD__": 0,
        "137739": 1,
        "142840": 2,
        "225404": 3,
        "366810": 4,
        "160194": 5,
        "17377": 6,
        "397994": 7,
        "67660": 8,
        "264355": 9,
        "94871": 10,
        "150068": 11,
        "192463": 12,
        "385451": 13,
        "292338": 14,
        "95200": 15,
        "87006": 16,
        "349173": 17,
        "398575": 18,
        "398109": 19,
        "102833": 20,
        "259290": 21,
        "107755": 22,
        "363218": 23,
        "57459": 24,
        "244703": 25,
        "133243": 26,
        "202498": 27,
        "274193": 28,
        "183759": 29,
        "252478": 30,
        "93454": 31,
        "225230": 32,
        "112846": 33,
        "302529": 34,
        "138651": 35,
        "230502": 36,
        "256512": 37,
        "14905": 38,
        "234927": 39,
        "143482": 40,
        "241951": 41,
        "84597": 42,
        "181057": 43,
        "394213": 44,
        "133152": 45,
        "237347": 46,
        "38772": 47,
        "59075": 48,
        "184743": 49,
        "393232": 50,
        "408795": 51,
        "369584": 52,
        "419685": 53,
        "384547": 54,
        "223853": 55,
        "364151": 56,
        "360936": 57,
        "122722": 58,
        "119792": 59,
        "138066": 60,
        "187111": 61,
        "44486": 62,
        "345337": 63,
        "419872": 64,
        "265350": 65,
        "156256": 66,
        "421861": 67,
        "286110": 68,
        "188896": 69,
        "200410": 70,
        "246731": 71,
        "144634": 72,
        "254792": 73,
        "6710": 74,
        "35662": 75,
        "239633": 76,
        "166931": 77,
        "115316": 78,
        "155775": 79,
        "237467": 80,
        "345717": 81,
        "113420": 82,
        "346951": 83,
        "381129": 84,
        "101437": 85,
        "158024": 86,
        "153671": 87,
        "155404": 88,
        "399132": 89,
        "76510": 90,
        "348684": 91,
        "175802": 92,
        "8530": 93,
        "347880": 94,
        "386201": 95,
        "76341": 96,
        "330322": 97,
        "__OOV__": 98
    },
    "customer": {
        "__PAD__": 0,
        "1210": 1,
        "79797": 2,
        "215611": 3,
        "179648": 4,
        "22878": 5,
        "68631": 6,
        "214436": 7,
        "864": 8,
        "149747": 9,
        "5406": 10,
        "164284": 11,
        "21689": 12,
        "25728": 13,
        "239574": 14,
        "52598": 15,
        "254969": 16,
        "51721": 17,
        "24984": 18,
        "217182": 19,
        "573": 20,
        "223269": 21,
        "96798": 22,
        "117313": 23,
        "43184": 24,
        "13072": 25,
        "103078": 26,
        "5902": 27,
        "222509": 28,
        "42812": 29,
        "162663": 30,
        "56774": 31,
        "47076": 32,
        "75881": 33,
        "186875": 34,
        "55297": 35,
        "20604": 36,
        "33287": 37,
        "94205": 38,
        "32537": 39,
        "205433": 40,
        "183715": 41,
        "343": 42,
        "195682": 43,
        "28339": 44,
        "1823": 45,
        "155582": 46,
        "80092": 47,
        "49079": 48,
        "144223": 49,
        "14471": 50,
        "73832": 51,
        "63559": 52,
        "13787": 53,
        "37031": 54,
        "156608": 55,
        "185150": 56,
        "19216": 57,
        "120884": 58,
        "171746": 59,
        "11968": 60,
        "119724": 61,
        "238466": 62,
        "55729": 63,
        "228674": 64,
        "109572": 65,
        "36888": 66,
        "232575": 67,
        "7844": 68,
        "25760": 69,
        "82710": 70,
        "132719": 71,
        "224983": 72,
        "77114": 73,
        "57362": 74,
        "182659": 75,
        "189572": 76,
        "173817": 77,
        "184541": 78,
        "75534": 79,
        "155607": 80,
        "35990": 81,
        "252276": 82,
        "135248": 83,
        "124874": 84,
        "88742": 85,
        "172777": 86,
        "179212": 87,
        "53778": 88,
        "3024": 89,
        "131908": 90,
        "25471": 91,
        "83172": 92,
        "157846": 93,
        "27731": 94,
        "151804": 95,
        "171879": 96,
        "__OOV__": 97
    },
    "brand": {
        "__PAD__": 0,
        "158849": 1,
        "293023": 2,
        "144123": 3,
        "87032": 4,
        "337365": 5,
        "59477": 6,
        "90316": 7,
        "197848": 8,
        "339907": 9,
        "420137": 10,
        "40827": 11,
        "156936": 12,
        "58727": 13,
        "304332": 14,
        "455009": 15,
        "73218": 16,
        "180856": 17,
        "11022": 18,
        "220468": 19,
        "321464": 20,
        "364212": 21,
        "259883": 22,
        "395808": 23,
        "291723": 24,
        "290511": 25,
        "3130": 26,
        "95340": 27,
        "234028": 28,
        "409777": 29,
        "270537": 30,
        "194203": 31,
        "42518": 32,
        "139647": 33,
        "137274": 34,
        "53923": 35,
        "314219": 36,
        "247789": 37,
        "166416": 38,
        "41873": 39,
        "42695": 40,
        "206353": 41,
        "327032": 42,
        "389298": 43,
        "186516": 44,
        "215442": 45,
        "166878": 46,
        "65658": 47,
        "30520": 48,
        "80633": 49,
        "424150": 50,
        "106924": 51,
        "317982": 52,
        "425293": 53,
        "160253": 54,
        "388290": 55,
        "89842": 56,
        "302582": 57,
        "255820": 58,
        "98630": 59,
        "418677": 60,
        "141341": 61,
        "54471": 62,
        "194532": 63,
        "314496": 64,
        "106641": 65,
        "__OOV__": 66
    },
    "cms_segid": {
        "__PAD__": 0,
        "0": 1,
        "20": 2,
        "33": 3,
        "44": 4,
        "57": 5,
        "8": 6,
        "36": 7,
        "16": 8,
        "77": 9,
        "__OOV__": 10
    },
    "cms_group_id": {
        "__PAD__": 0,
        "3": 1,
        "4": 2,
        "5": 3,
        "1": 4,
        "7": 5,
        "9": 6,
        "2": 7,
        "8": 8,
        "10": 9,
        "__OOV__": 10
    },
    "final_gender_code": {
        "__PAD__": 0,
        "2": 1,
        "1": 2,
        "__OOV__": 3
    },
    "age_level": {
        "__PAD__": 0,
        "3": 1,
        "4": 2,
        "1": 3,
        "5": 4,
        "2": 5,
        "__OOV__": 6
    },
    "pvalue_level": {
        "__PAD__": 0,
        "2": 1,
        "1": 2,
        "__OOV__": 3
    },
    "shopping_level": {
        "__PAD__": 0,
        "3": 1,
        "1": 2,
        "2": 3,
        "__OOV__": 4
    },
    "occupation": {
        "__PAD__": 0,
        "0": 1,
        "1": 2,
        "__OOV__": 3
    }
}